html/schoolwork.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-03 日 10:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学校作业记录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Steiner" />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">学校作业记录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org301d3d6">1. School Work Record</a>
<ul>
<li><a href="#org03897d6">1.1. 数据结构实践作业</a>
<ul>
<li><a href="#orge6c353d">1.1.1. <span class="done DONE">DONE</span> 问题1</a></li>
<li><a href="#org9907173">1.1.2. <span class="todo TODO">TODO</span> 问题2</a></li>
<li><a href="#orgb7fbe70">1.1.3. <span class="done DONE">DONE</span> 问题3</a></li>
<li><a href="#orga07cfe3">1.1.4. <span class="done DONE">DONE</span> 问题5</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org301d3d6" class="outline-2">
<h2 id="org301d3d6"><span class="section-number-2">1</span> School Work Record</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org03897d6" class="outline-3">
<h3 id="org03897d6"><span class="section-number-3">1.1</span> 数据结构实践作业</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="practise">goto project</a><br />
</p>
</div>
<div id="outline-container-orge6c353d" class="outline-4">
<h4 id="orge6c353d"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> 问题1</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
对中等规模、大规模的图书摆放，你有什么更好的建议？<br />
以书名作为索引，使用二叉平衡树进行存储，比如红黑树<br />
使用平衡树存储<br />
</p>
<ul class="org-ul">
<li>插入的时间复杂度为 <code>O(logN)</code><br /></li>
<li>删除的时间复杂度为 <code>O(logN)</code><br /></li>
<li>查找的时间复杂度为 <code>O(logN)</code><br /></li>
</ul>
</div>
</div>

<div id="outline-container-org9907173" class="outline-4">
<h4 id="org9907173"><span class="section-number-4">1.1.2</span> <span class="todo TODO">TODO</span> 问题2</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
用几种算法实现上面的题目，计算每种算法的基本操作的执行次数，分析该算法的时间复杂度，说明算法与时间复杂度的关系。<br />
</p>
</div>
</div>

<div id="outline-container-orgb7fbe70" class="outline-4">
<h4 id="orgb7fbe70"><span class="section-number-4">1.1.3</span> <span class="done DONE">DONE</span> 问题3</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
完成选择法排序算法设计与实现，并分析算法最好情况、最差情况和平均情况的时间复杂度。<br />
</p>
<ul class="org-ul">
<li>最好情况下，时间复杂度为 <code>O(n)</code><br /></li>
<li>最差情况下，时间复杂度为 <code>O(n^2)</code><br /></li>
<li>平均情况下，时间复杂度为 <code>O(n^2)</code><br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">void</span> <span style="color: #a626a4;">swap</span><span style="color: #707183;">(</span><span style="color: #986801;">int</span> &amp; <span style="color: #6a1868;">a</span>, <span style="color: #986801;">int</span> &amp; <span style="color: #6a1868;">b</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #e45649; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>a != b<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    a ^= b;
    b ^= a;
    a ^= b;
  <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #986801;">int</span> <span style="color: #a626a4;">findmin</span><span style="color: #707183;">(</span><span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> &amp; <span style="color: #6a1868;">nums</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">start</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">end</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">_min</span> = start;
  <span style="color: #e45649; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span> = start + 1; index &lt;= end; index += 1<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    <span style="color: #e45649; font-weight: bold;">if</span><span style="color: #909183;">(</span>nums<span style="color: #709870;">[</span>_min<span style="color: #709870;">]</span> &gt; nums<span style="color: #709870;">[</span>index<span style="color: #709870;">]</span><span style="color: #909183;">)</span> <span style="color: #909183;">{</span>
      _min = index;
    <span style="color: #909183;">}</span> <span style="color: #e45649; font-weight: bold;">else</span> <span style="color: #909183;">{</span>
      <span style="color: #e45649; font-weight: bold;">continue</span>;
    <span style="color: #909183;">}</span>
  <span style="color: #7388d6;">}</span>

  <span style="color: #e45649; font-weight: bold;">return</span> _min;
<span style="color: #707183;">}</span>



<span style="color: #986801;">int</span> <span style="color: #a626a4;">firstindex</span><span style="color: #707183;">(</span><span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> &amp; <span style="color: #6a1868;">nums</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #e45649; font-weight: bold;">return</span> 0;
<span style="color: #707183;">}</span>

<span style="color: #986801;">int</span> <span style="color: #a626a4;">lastindex</span><span style="color: #707183;">(</span><span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> &amp; <span style="color: #6a1868;">nums</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #e45649; font-weight: bold;">return</span> nums.size<span style="color: #7388d6;">()</span> - 1;
<span style="color: #707183;">}</span>

<span style="color: #986801;">void</span> <span style="color: #a626a4;">select_sort</span><span style="color: #707183;">(</span><span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> &amp; <span style="color: #6a1868;">nums</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">start</span> = firstindex<span style="color: #7388d6;">(</span>nums<span style="color: #7388d6;">)</span>;
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">end</span> = lastindex<span style="color: #7388d6;">(</span>nums<span style="color: #7388d6;">)</span>;

  <span style="color: #e45649; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span> = start; index &lt;= end; index += 1<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    <span style="color: #986801;">int</span> <span style="color: #6a1868;">_min</span> = findmin<span style="color: #909183;">(</span>nums, index, end<span style="color: #909183;">)</span>;
    swap<span style="color: #909183;">(</span>nums<span style="color: #709870;">[</span>index<span style="color: #709870;">]</span>, nums<span style="color: #709870;">[</span>_min<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
  <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>

<span style="color: #986801;">int</span> <span style="color: #a626a4;">main</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
  <span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> <span style="color: #6a1868;">nums</span> = <span style="color: #7388d6;">{</span>3, 38, 44, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48<span style="color: #7388d6;">}</span>;
  select_sort<span style="color: #7388d6;">(</span>nums<span style="color: #7388d6;">)</span>;

  <span style="color: #e45649; font-weight: bold;">for</span><span style="color: #7388d6;">(</span><span style="color: #986801;">int</span> &amp; <span style="color: #6a1868;">data</span>: nums<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    cout &lt;&lt; data &lt;&lt; <span style="color: #50a14f;">' '</span>;
  <span style="color: #7388d6;">}</span>

  cout &lt;&lt; endl;
  <span style="color: #e45649; font-weight: bold;">return</span> 0;
<span style="color: #707183;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orga07cfe3" class="outline-4">
<h4 id="orga07cfe3"><span class="section-number-4">1.1.4</span> <span class="done DONE">DONE</span> 问题5</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
对于一维数组 <code>A[0..n-1] (n&gt;1)</code> ，设计在时间和空间方面尽可量有效率的算法，<br />
将A中的序列循环左移 <code>p(0&lt;p&lt;n)</code> 个位置，<br />
即将 <code>A</code> 中的数据从 <code>(A0, A1, ......, An-1)</code><br />
转变成 <code>(Ap,Ap+1,......,An-1,A0,A1,......,Ap-1</code><br />
要求用几种算法（尽可能多）实现上述题目。并分析每种算法的时间和空间复杂度。<br />
</p>
<ul class="org-ul">
<li>时间复杂度为 <code>O(n)</code><br /></li>
<li>空间复杂度为 <code>O(n)</code><br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">vector</span><span style="color: #707183;">&lt;</span><span style="color: #986801;">int</span><span style="color: #707183;">&gt;</span> <span style="color: #a626a4;">shiftleft</span><span style="color: #707183;">(</span><span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> &amp;<span style="color: #6a1868;">nums</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">p</span><span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">n</span> = nums.size<span style="color: #7388d6;">()</span> - 1;
  assert<span style="color: #7388d6;">(</span>p &gt; 0 &amp;&amp; p &lt; n<span style="color: #7388d6;">)</span>;

  <span style="color: #986801;">vector</span><span style="color: #7388d6;">&lt;</span><span style="color: #986801;">int</span><span style="color: #7388d6;">&gt;</span> <span style="color: #6a1868;">result</span>;
  <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span> = p; index &lt;= n - 1; index += 1<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    result.push_back<span style="color: #909183;">(</span>nums<span style="color: #709870;">[</span>index<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
  <span style="color: #7388d6;">}</span>

  <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span> = 0; index &lt;= p - 1; index += 1<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    result.push_back<span style="color: #909183;">(</span>nums<span style="color: #709870;">[</span>index<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
  <span style="color: #7388d6;">}</span>

  <span style="color: #e45649; font-weight: bold;">return</span> result;
<span style="color: #707183;">}</span>

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Steiner</p>
<p class="date">Created: 2021-10-03 日 10:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>